Тестовая_база_ERP_14/src/InformationRegisters/РегистрацииВНалоговомОргане/РегистрацииВНалоговомОргане.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РегистрацииВНалоговомОргане</name>
  <resources>
    <name>РегистрацияВНалоговомОргане</name>
    <type>
      <types>CatalogRef.РегистрацииВНалоговомОргане</types>
    </type>
  </resources>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Тестовая_база_ERP_14/src/CommonModules/ЗаполнениеФормСтатистикиПоОбособленнымПодразделениямПереопределяемый/Module.bsl
// ПРОГРАММНЫЙ ИНТЕРФЕЙС
//
#Область ПрограммныйИнтерфейс

// Процедура заполняет отбор компоновки данных по обособленным подразделениям.
// Далее отбор по подразделениям накладывается на другие отборы источника данных (см. ЗаполнениеФормСтатистики.ЗаполнитьФормуСтатистики()).
//
// Параметры:
//  ОтборПоПодразделениям		- Неопределено	- исходящий параметр, в который помещается заполненный отбор.
//								  Если отбор в процедуре не будет определен, то на источники данных формы статистики отбор по подразделению не накладывается. 			
//  Организация					- СправочникСсылка.Организации - организация, по которой заполняется стат. отчет
//  ОбособленноеПодразделение	- СправочникСсылка.ПодразделенияОрганизаций - подразделение, по которому заполняется стат. отчет
//  ИсключитьДанныеОбособленныхПодразделений 
//								- Булево - признак, что стат. отчет заполняется по организации, без входящих в нее обособленных подразделений.
//
Процедура ЗаполнитьОтборПоОбособленнымПодразделениям(ОтборПоПодразделениям, Организация, ОбособленноеПодразделение, ИсключитьДанныеОбособленныхПодразделений) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ОбособленноеПодразделение) И НЕ ИсключитьДанныеОбособленныхПодразделений Тогда
		Возврат;
	КонецЕсли;	
		
	ЗначениеОтбора 			= Неопределено;
	ВидСравненияКомпоновки  = ВидСравненияКомпоновкиДанных.Равно;
	
	Если ИсключитьДанныеОбособленныхПодразделений Тогда
		
		// Исключаем данные обособленных подразделений, у которых:
		//  - заполнен код ОКПО
		//  - код ОКПО не равен ОКПО организации.
	
		КодПоОКПО = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Организация, "КодПоОКПО");
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ПодразделенияОрганизаций.Подразделение КАК Ссылка
			|ИЗ
			|	РегистрСведений.РегистрацииВНалоговомОргане КАК ПодразделенияОрганизаций
			|ГДЕ
			|	ПодразделенияОрганизаций.Организация = &Организация
			|	И ЛОЖЬ"; // код ОКПО для подразделений пока не задается, поэтому результат запроса всегда будет пустой
		
		Запрос.УстановитьПараметр("Организация", Организация);
		Запрос.УстановитьПараметр("КодПоОКПО",   КодПоОКПО);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если РезультатЗапроса.Пустой() Тогда
			// У организации нет обособленных подразделений, данные которых нужно исключить.
			// Вообще не устанавливаем отбор по подразделениям.
			Возврат;
		КонецЕсли;	
		
		ТаблицаРезультата = РезультатЗапроса.Выгрузить();
		Если ТаблицаРезультата.Количество() = 1 Тогда
			// Добавляем в отбор условие, что подразделение не равно найденному обособленному подразделению.
			ЗначениеОтбора 			= ТаблицаРезультата[0].Ссылка;
			ВидСравненияКомпоновки 	= ВидСравненияКомпоновкиДанных.НеРавно;
		Иначе	
			// Добавляем в отбор условие, что подразделение не в списке обособленных подразделений.
			ЗначениеОтбора = Новый СписокЗначений;
			ЗначениеОтбора.ЗагрузитьЗначения(ТаблицаРезультата.ВыгрузитьКолонку("Ссылка"));
			ВидСравненияКомпоновки 	= ВидСравненияКомпоновкиДанных.НеВСписке;
		КонецЕсли;	
		
	Иначе
		
		КодПоОКПО = ""; // код ОКПО для подразделений пока не задается
		
		Если ЗначениеЗаполнено(КодПоОКПО) Тогда
			// Добавляем в отбор все подразделения с таким кодом ОКПО
			Запрос = Новый Запрос;
			
			Запрос.УстановитьПараметр("Организация", Организация);
			Запрос.УстановитьПараметр("КодПоОКПО",   КодПоОКПО);
			
			Запрос.Текст = 
				"ВЫБРАТЬ
				|	ПодразделенияОрганизаций.Подразделение КАК Ссылка
				|ИЗ
				|	РегистрСведений.РегистрацииВНалоговомОргане КАК ПодразделенияОрганизаций
				|ГДЕ
				|	ПодразделенияОрганизаций.Организация = &Организация
				|	И ЛОЖЬ"; // код ОКПО для подразделений пока не задается
			
			РезультатЗапроса = Запрос.Выполнить();
			ТаблицаРезультата = РезультатЗапроса.Выгрузить();
			Если ТаблицаРезультата.Количество() = 1 Тогда
				// Добавляем в отбор условие, что подразделение равно выбранному обособленному подразделению.
				ЗначениеОтбора 			= ТаблицаРезультата[0].Ссылка;
				ВидСравненияКомпоновки 	= ВидСравненияКомпоновкиДанных.Равно;
			Иначе	
				// Добавляем в отбор условие, что подразделение в списке обособленных подразделений
				ЗначениеОтбора = Новый СписокЗначений;
				ЗначениеОтбора.ЗагрузитьЗначения(ТаблицаРезультата.ВыгрузитьКолонку("Ссылка"));
				ВидСравненияКомпоновки 	= ВидСравненияКомпоновкиДанных.ВСписке;
			КонецЕсли;	
			
		Иначе
			// Отбор только по одному указанному элементу
			ЗначениеОтбора 			= ОбособленноеПодразделение;
			ВидСравненияКомпоновки 	= ВидСравненияКомпоновкиДанных.Равно;
		КонецЕсли;	
		
	КонецЕсли;
	
	ОтборПоПодразделениям 	= Новый ОтборКомпоновкиДанных;
	БухгалтерскиеОтчетыКлиентСервер.ДобавитьОтбор(
		ОтборПоПодразделениям,
		"ОбособленноеПодразделение",
		ЗначениеОтбора,
		ВидСравненияКомпоновки);
		
КонецПроцедуры	

#КонецОбласти
